--  Управляющие структуры: примеры if и case
--  Содержание:
--    1. Простейший if
--    2. if с веткой else
--    3. if с несколькими elsif
--    4. case с числами
--    5. case с символами

with Ada.Text_IO; use Ada.Text_IO;


procedure branches is
   
   X : Integer := 5;
   Y : Integer := -3;
   C : Character := 'B';

begin

   Put_Line("=== НАЧАЛО ПРОГРАММЫ ===");
   New_Line;

   --------------------------------------------------------------------
   -- 1. ПРОСТОЙ IF
   --------------------------------------------------------------------
   Put_Line("Пример простого if:");
   if X > 0 then
      Put_Line("X положитленео чиисло");
   end if;
   New_Line;

   --------------------------------------------------------------------
   -- 2. IF + ELSE
   --------------------------------------------------------------------
   Put_Line("Пример if с else:");
   if Y >= 0 then
      Put_Line("Y неотрицательное");
   else
      Put_Line("Y отрицательное");
   end if;
   New_Line;

   --------------------------------------------------------------------
   -- 3. IF + ELSIF + ELSE
   --------------------------------------------------------------------
   Put_Line("Пример if с elsif:");
   if X < 0 then
      Put_Line("X отрирцательное");
   elsif X = 0 then
      Put_Line("X равен нулю");
   else
      Put_Line("X положительное");
   end if;
   New_Line;

   --------------------------------------------------------------------
   -- 4. CASE С ЧИСЛАМИ
   --------------------------------------------------------------------
   Put_Line("Пример case с числами:");
   case X is
      when 1 => 
         Put_Line("X = 1");
      when 2 | 3 =>
         Put_Line("X = 2 или 3");
      when 4 .. 6 => 
         Put_Line("X в диапазоне 4 .. 6");
      when others => 
         Put_Line("X не входит в перечисленные варианты");
   end case;
   New_Line; 


   --------------------------------------------------------------------
   -- 5. CASE С СИМВОЛАМИ
   --------------------------------------------------------------------
   Put_Line("Пример case с символами:");
   case C is
      when 'A' =>
         Put_Line("Символ A");
      when 'B' => 
         Put_Line("Символ B");
      when 'C' .. 'Z' =>
         Put_Line("Буква от C до Z");
      when others =>
         Put_Line("Неизвестный символ");
   end case;

   New_Line;

   Put_Line("=== КОНЕЦ ПРОГРАММЫ ===");

end branches;
